[
 {
   "Club_name": "CEG TECH FORUM",
   "Club_type_keywords": "Technical, projects, technical event organisation, innovation",
   "Club_description": "The CEG Tech Forum, was convened to nurture the scientific temper of the student populace. Engineering projects pertaining to the needs of the society are an integral part of the successful ventures undertaken by CTF. The forum also organizes Kurukshetra, one of the biggest techno-management events of the country."
 },
 {
   "Club_name": "GUINDY TIMES",
   "Club_type_keywords": "English, writing, ",
   "Club_description": "The Guindy Times is the official campus magazine of CEG, AC Tech and SAP. This students' magazine is a media body which aims to provide regular updates regarding all the happenings of the college."
 },
 {
   "Club_name": "LITERARY CLUB OF ANNA UNIVERSITY",
   "Club_type_keywords": "English, speaking, writing, non technical events",
   "Club_description": "The literary club seeks to nurture the literary talents of the students. It conducts various inter- and intra- college events and training activities through the year in this sphere."
 },
 {
   "Club_name": "ROBOTICS CLUB",
   "Club_type_keywords": "Technical, robotics, projects",
   "Club_description": "With an untiring motive of pervading the knowledge of Robotics among the students, the robotics club conducts various workshops and courses through the year.Further, internship opportunities are provided for excelling candidates."
 },
 {
   "Club_name": "ROTARACT CLUB OF CEG",
   "Club_type_keywords": "Leadership, professional skills, event organisation",
   "Club_description": "The Rotaract club seeks to improve the leadership and professional skills of the students in addition to moulding them into responsible individuals. They organize various events that foster the spirit of social responsibility."
 },
 {
   "Club_name": "CAPITALISE",
   "Club_type_keywords": "Entrepreneurial skills, professional skills",
   "Club_description": "A wing of the entrepreneur development cell of CEG, capitalize enables the interested to take informed decisions to bring in successful entrepreneur and students on a common platform.Further, the club motivates the members on various dimensions of industry to nurture the latent entrepreneurial talent."
 },
 {
   "Club_name": "ACM STUDENT CHAPTER OF CEG",
   "Club_type_keywords": "Technical, computer science",
   "Club_description": "The ACM Student Chapter of CEG, generally abbreviated as ACM CEG is the official student Chapter of ACM in the institution. It's aim is to motivate students to embark on the journey of learning and developing the tools of computer science and instilling in them a passion for computer science. It serves to clear the clutter and provide guidance to help them to achieve their goals."
 },
 {
   "Club_name": "QUIZZERS ANONYMOUS",
   "Club_type_keywords": "Quizzing, non technical events",
   "Club_description": "The quiz club is dedicated to preparing and conducting quality quizzing events and training sessions to nurture the quizzing skills in students host competitions that assess the quizzers in various fields of knowledge and arts."
 },
 {
   "Club_name": "THEATRON",
   "Club_type_keywords": "Theatre, art",
   "Club_description": "As the official theatre club of CEG, Theatron produces plays while maintaining a commitment to living playwrights and taking a comprehensive approach to artistic development and arts education. Its mission and values give CEG a unique place in Indian theatre."
 },
 {
   "Club_name": "SIRUTHULIGAL",
   "Club_type_keywords": "Volunteering",
   "Club_description": "An entirely student volunteered club, siruthuligal aims to provide financial aid for academic and medical purposes to the students."
 },
 {
   "Club_name": "CSAU",
   "Club_type_keywords": "Technical, computer science",
   "Club_description": "With the primary aim to enhance students’ knowledge in the field of computer science, this club conducts various workshops and courses through the year."
 },
 {
   "Club_name": "MATHAVAM",
   "Club_type_keywords": "Tamil, speaking, writing",
   "Club_description": "Mathavam is the association of the Tamil enthusiasts of the college. With a shared love for literature and language, this club brings a pool of talent for utilization."
 },
 {
   "Club_name": "SAPTHAM",
   "Club_type_keywords": "Classical, dance, singing",
   "Club_description": "Seeking to encourage students in the field of classical performing arts, Saptham provides ample opportunities to students to showcase their singing and dancing talents."
 },
 {
   "Club_name": "CEG SPARTANZ",
   "Club_type_keywords": "street theatre, arts",
   "Club_description": "The official variety show troupe of the college help students exhibit their talents and passion for street theater"
 },
 {
   "Club_name": "TWISTERS",
   "Club_type_keywords": "Dance",
   "Club_description": "The official dance troupe of CEG, with extremely high reputation in the city for excellence in performance and creativity, train and encourage the interested with distinctive dance techniques."
 },
 {
   "Club_name": "LEO CLUB OF CEG",
   "Club_type_keywords": "Leadership, professional skills",
   "Club_description": "The Leo club focusses on enhancing the leadership skills of the students along with providing varied opportunities and experiences for all around improvement."
 },
 {
   "Club_name": "GREEN BRIGADE",
   "Club_type_keywords": "Volunteering",
   "Club_description": "Green brigade is the only non-technical club of CEG that aims to promote environmental awareness. It also organizes various events in association with other NGOs that work for similar causes."
 },
 {
   "Club_name": "SRUTHILAYA",
   "Club_type_keywords": "Singing, music",
   "Club_description": "With shared interest and passion in music, sruthilaya functions as the official band of CEG. Influenced by indian, western and regional pop, the band performs multiple genres and has acquired high acclaim by winning various competitions."
 },
 {
   "Club_name": "AAKRITHI",
   "Club_type_keywords": "All female, singing, dance",
   "Club_description": "An exclusive all women’s club, Aakrithi seeks to reach out and help in the holistic development of the girls, in all facets."
 },
 {
   "Club_name": "SCI",
   "Club_type_keywords": "creativity, innovation, projects",
   "Club_description": "The Students Creativity and Innovation lab functions in a way which ultimately develops creativity and innovation into students, making them to stand out in a crowd."
 },
 {
   "Club_name": "SQC",
   "Club_type_keywords": "Professional skills, technical",
   "Club_description": "The Students Quality Club is a forum to empower the students to significantly improve their personal and professional effectiveness, by offering opportunities to enable them to have a first hand industry experience."
 },
 {
   "Club_name": "BEATFREAKZ",
   "Club_type_keywords": "All female, dance",
   "Club_description": "Beatfreakz is an all female dance crew known for their graceful, high energy performances and their dedication to the craft."
 },
 {
   "Club_name": "PIXELS",
   "Club_type_keywords": "Photography, art, non technical",
   "Club_description": "It is the official photography and videography club of CEG and a wonderful platform for those passionate about the art of photography"
 },
 {
   "Club_name": "ASTRO CLUB",
   "Club_type_keywords": "Astronomy, non technical",
   "Club_description": "Astro Club is the official Astronomy and Planetary Sciences club of Anna university and is a platform meant for anyone and everyone interesed in astronomy."
 }
]